Revit 2024 API
BuiltInFailures.FamilyFailures.SlantedColumnEndPlanesHaveFlipped Property
 Position of end cut planes has resulted in a slanted column without any geometry.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId SlantedColumnEndPlanesHaveFlipped { get; }
Visual Basic
Public Shared ReadOnly Property SlantedColumnEndPlanesHaveFlipped As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ SlantedColumnEndPlanesHaveFlipped {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace